In [1]:
#DataFrame

In [2]:
import numpy as np
import pandas as pd

In [3]:
data=['hari','dola','rahul','sai']

In [4]:
df=pd.DataFrame(data,index=[301,302,303,304])

In [5]:
df

         0
301   hari
302   dola
303  rahul
304    sai

In [9]:
data=[['hari','dola','rahul','sai'],[1,2,3,4]]

In [14]:
df=pd.DataFrame(data,dtype='float')

In [11]:
df

      0     1      2    3
0  hari  dola  rahul  sai
1     1     2      3    4

In [16]:
data=[['hari',301],['dola',302],['sai','303'],['krish',304]]

In [18]:
df=pd.DataFrame(data,index=[1,2,3,4],dtype='float')

In [19]:
df

       0      1
1   hari  301.0
2   dola  302.0
3    sai  303.0
4  krish  304.0

In [20]:
type(df)

pandas.core.frame.DataFrame

In [21]:
#using dictionary

In [23]:
data={'student_name':['hari','dola','rahul','sai'],'roll_no':[301,302,303,304]}

In [24]:
df=pd.DataFrame(data,index=[4,3,2,1],dtype='float')

In [25]:
df

  student_name  roll_no
4         hari    301.0
3         dola    302.0
2        rahul    303.0
1          sai    304.0